{
  "intro": "The Communication and Signal Processing Research Group focuses on the development, analysis, and application of techniques for transmitting, receiving, and processing information-bearing signals. The group conducts both theoretical and experimental research across various domains of modern communication systems.",
  "keyActivitiesTitle": "Key Activities Include :",
  "keyActivities": [
    {
      "title": "Digital Signal Processing (DSP)",
      "desc": "Developing algorithms for signal enhancement, filtering, compression, and feature extraction."
    },
    {
      "title": "Wireless Communication Systems",
      "desc": "Investigating physical layer protocols for 5G, 6G, and future wireless technologies."
    },
    {
      "title": "MIMO and Beamforming",
      "desc": "Exploring spatial signal processing techniques to increase channel capacity and reliability."
    },
    {
      "title": "Machine Learning for Signal Processing",
      "desc": "Applying AI and deep learning models to improve communication system performance, especially in dynamic environments."
    },
    {
      "title": "Software-Defined Radio (SDR) and Embedded Systems",
      "desc": "Implementing and testing real-time communication algorithms on hardware platforms."
    },
    {
      "title": "Spectrum Sensing and Cognitive Radio",
      "desc": "Researching adaptive spectrum access techniques for dynamic spectrum allocation."
    },
    {
      "title": "Audio Video Transmision",
      "desc": "Researching Audio and Video in Telecommunication Systems."
    }
  ],
  "outcomeIntro": "The group’s research outcomes are applied in various fields including:",
  "outcomes": [
    "Radar systems",
    "Synthetic Aperture Radar (SAR)",
    "Autonomous transportation systems",
    "Internet of Things (IoT)",
    "Biomedical signal processing",
    "Intelligent transportation systems"
  ],
  "collaboration": "Collaboration with academic institutions, research centers, and industry partners is actively pursued to ensure real-world impact and continuous innovation."
}
